#### Terraform working directory 🏠: `demo/demo-account/demo-application/ec2`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_host["test-host"].aws_ec2_host.this will be created
  + resource "aws_ec2_host" "this" {
      + arn               = (known after apply)
      + asset_id          = (known after apply)
      + auto_placement    = "on"
      + availability_zone = "ap-southeast-1a"
      + host_recovery     = "on"
      + id                = (known after apply)
      + instance_type     = "c5.18xlarge"
      + owner_id          = (known after apply)
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
